; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v6 - type_3 ?v3 - type_2)
 	      (pred_1 ?v8 - object ?v3 - type_2)
	      (pred_3 ?v6 - type_3 ?v1 - type_1)
	      (pred_2 ?v6 - type_3 ?v8 - object ?v1 - type_1))

   (:action op_1
       :parameters  (?v6 - type_3 ?v7 ?v4 - type_2)
       :precondition (and  (pred_4 ?v6 ?v7))
       :effect (and  (pred_4 ?v6 ?v4)
		     (not (pred_4 ?v6 ?v7))))

   (:action op_2
       :parameters (?v6 - type_3 ?v5 - object ?v2 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_1 ?v5 ?v2) (pred_4 ?v6 ?v2) (pred_3 ?v6 ?v1))
       :effect (and (pred_2 ?v6 ?v5 ?v1)
		    (not (pred_1 ?v5 ?v2)) 
		    (not (pred_3 ?v6 ?v1))))

   (:action op_3
       :parameters (?v6 - type_3 ?v5 - object ?v2 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v6 ?v5 ?v1) (pred_4 ?v6 ?v2))
       :effect (and (pred_1 ?v5 ?v2)
		    (pred_3 ?v6 ?v1)
		    (not (pred_2 ?v6 ?v5 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_12 - type_3
obj_04 obj_10 obj_08 obj_03 - type_1
obj_09 obj_13 obj_02 obj_06 - type_2
obj_11 obj_01 obj_14 obj_05 - object)
(:init
(pred_4 obj_07 obj_02)
(pred_3 obj_07 obj_04)
(pred_3 obj_07 obj_10)
(pred_4 obj_12 obj_02)
(pred_3 obj_12 obj_08)
(pred_3 obj_12 obj_03)
(pred_1 obj_11 obj_06)
(pred_1 obj_01 obj_13)
(pred_1 obj_14 obj_06)
(pred_1 obj_05 obj_06)
)
(:goal
(and
(pred_1 obj_11 obj_13)
(pred_1 obj_01 obj_06)
(pred_1 obj_14 obj_13)
(pred_1 obj_05 obj_09)
)
)

(:constraints
  (always (not (pred_4 obj_07 obj_06)))
)
)

; plan
1. (op_1 obj_07 obj_02 obj_13)
   deleted: (pred_4 obj_07 obj_02)
   added: (pred_4 obj_07 obj_13)
   goals met: 0 of 4
2. (op_1 obj_12 obj_02 obj_13)
   deleted: (pred_4 obj_12 obj_02)
   added: (pred_4 obj_12 obj_13)
   goals met: 0 of 4
3. (op_2 obj_12 obj_01 obj_13 obj_03)
   deleted: (pred_1 obj_01 obj_13) (pred_3 obj_12 obj_03)
   added: (pred_2 obj_12 obj_01 obj_03)
   goals met: 0 of 4
4. (op_1 obj_12 obj_13 obj_06)
   deleted: (pred_4 obj_12 obj_13)
   added: (pred_4 obj_12 obj_06)
   goals met: 0 of 4
5. (op_3 obj_12 obj_01 obj_06 obj_03)
   deleted: (pred_2 obj_12 obj_01 obj_03)
   added: (pred_1 obj_01 obj_06) (pred_3 obj_12 obj_03)
   goals met: 1 of 4
6. (op_2 obj_12 obj_05 obj_06 obj_03)
   deleted: (pred_1 obj_05 obj_06) (pred_3 obj_12 obj_03)
   added: (pred_2 obj_12 obj_05 obj_03)
   goals met: 1 of 4
7. (op_1 obj_12 obj_06 obj_09)
   deleted: (pred_4 obj_12 obj_06)
   added: (pred_4 obj_12 obj_09)
   goals met: 1 of 4
8. (op_3 obj_12 obj_05 obj_09 obj_03)
   deleted: (pred_2 obj_12 obj_05 obj_03)
   added: (pred_1 obj_05 obj_09) (pred_3 obj_12 obj_03)
   goals met: 2 of 4
9. (op_1 obj_12 obj_09 obj_06)
   deleted: (pred_4 obj_12 obj_09)
   added: (pred_4 obj_12 obj_06)
   goals met: 2 of 4
10. (op_2 obj_12 obj_11 obj_06 obj_03)
   deleted: (pred_1 obj_11 obj_06) (pred_3 obj_12 obj_03)
   added: (pred_2 obj_12 obj_11 obj_03)
   goals met: 2 of 4
11. (op_2 obj_12 obj_14 obj_06 obj_08)
   deleted: (pred_1 obj_14 obj_06) (pred_3 obj_12 obj_08)
   added: (pred_2 obj_12 obj_14 obj_08)
   goals met: 2 of 4
12. (op_1 obj_12 obj_06 obj_13)
   deleted: (pred_4 obj_12 obj_06)
   added: (pred_4 obj_12 obj_13)
   goals met: 2 of 4
13. (op_3 obj_12 obj_14 obj_13 obj_08)
   deleted: (pred_2 obj_12 obj_14 obj_08)
   added: (pred_1 obj_14 obj_13) (pred_3 obj_12 obj_08)
   goals met: 3 of 4
14. (op_3 obj_12 obj_11 obj_13 obj_03)
   deleted: (pred_2 obj_12 obj_11 obj_03)
   added: (pred_1 obj_11 obj_13) (pred_3 obj_12 obj_03)
   goals met: 4 of 4
